Revit 2027 API
BuiltInFailures.WallFailures.InvalidCompoundStructure Property
 Invalid compound structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidCompoundStructure { get; }
Public Shared ReadOnly Property InvalidCompoundStructure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidCompoundStructure {
	FailureDefinitionId^ get ();
}
static member InvalidCompoundStructure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace